metadata-api-create-custom-object.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:met="http://soap.sforce.com/2006/04/metadata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <met:SessionHeader>
            <met:sessionId>{{SessionId}}</met:sessionId>
        </met:SessionHeader>
    </soapenv:Header>
    <soapenv:Body>
        <met:createMetadata>
            <metadata xsi:type="met:CustomObject">
                <fullName>Invoice__c</fullName>
                <label>Invoice</label>
                <pluralLabel>Invoices</pluralLabel>
                <deploymentStatus>Deployed</deploymentStatus>
                <sharingModel>Read</sharingModel>
                <description>Created by Metadata API Call</description>
                <enableReports>False</enableReports>
                <nameField>
                    <label>ID</label>
                    <type>AutoNumber</type>
                </nameField>
            </metadata>
        </met:createMetadata>
    </soapenv:Body>
</soapenv:Envelope>
